Catalogs/ПриложенияКДоговорам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ПриложенияКДоговорам</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВнутреннийЗапасВНеделях</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаДоговора</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерДоговора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПоПорядку</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отказ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокМонтажаВНеделях</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокОкончанияМонтажа</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокОкончанияПКД</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокОкончанияПроизводства</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокПроектированияВНеделях</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокПроизводстваВНеделях</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодписьДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодписьАвтор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ИзделияЗаказчика</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИзделиеЗаказчика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИзделияЗаказчика</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>УслугиПриложенияДоговора</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>УслугаПриложенияДоговора</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УслугиПриложенияДоговора</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/ДанныеИзделияЗаказчика.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ДанныеИзделияЗаказчика</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Актуальность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерПоПорядку</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Артикул</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НаименованиеСАртикулом</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПриложениеКДоговору</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПриложенияКДоговорам</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИзделиеЗаказчика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИзделияЗаказчика</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/ИзделияЗаказчика.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ИзделияЗаказчика</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолноеНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПомещенияСтрокой</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазмерПоТЗ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦенаВДоговоре</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ИзделияЭлемент</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИзделиеЭлемент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИзделияЭлемент</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Помещения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Помещение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Помещения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ПриложенияКДоговорам/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ИзделияЗаказчикаИзделиеЗаказчикаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ДополнительныеПараметры = Новый Структура("ТД,Отказ,НомерПоПорядку"
	,Элементы.ИзделияЗаказчика.ТекущиеДанные,Объект.Отказ,Объект.НомерПоПорядку);
	омИзделияЗаказчикаКлиент.ОткрытьПодборИзделияЗаказчика(Объект, ЭтаФорма, СтандартнаяОбработка,ДополнительныеПараметры);
КонецПроцедуры

&НаКлиенте
Процедура ЭлементыСделкиПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
	ДополнительныеПараметры = Новый Структура("ТД,Отказ,НомерПоПорядку"
	,Неопределено,Объект.Отказ,Объект.НомерПоПорядку);
	
	омИзделияЗаказчикаКлиент.ОткрытьПодборИзделияЗаказчика(Объект, ЭтаФорма,,ДополнительныеПараметры);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораИзделияЗаказчика(Результат, ДополнительныеПараметры) Экспорт
	
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;                         
	
	Если ДополнительныеПараметры.ТД = Неопределено Тогда
		ТД = Объект.ИзделияЗаказчика.Добавить();
	Иначе
		ТД = ДополнительныеПараметры.ТД;	
	КонецЕсли;
	
	ТД.ИзделиеЗаказчика = Результат;	
	
	Если ЭтаФорма.ПоказыватьЦену Тогда
		ТД.Цена = ПолучитьЦенуИзделияЗаказчика(Результат);
		СуммаДоговораСтрокой();
	КонецЕсли;
	
КонецПроцедуры // ПослеВыбораИзделияЗаказчика()

&НаСервереБезКонтекста
Функция ПолучитьПомщение(ИзделиеЗаказчика)

	Возврат омИзделиеЗаказчика.ПолучитьПомещенияИзделияЗаказчика(ИзделиеЗаказчика);	

КонецФункции // ПолучитьПомщение(ИзделиеЗаказчика)

&НаСервереБезКонтекста
Функция ПолучитьЦенуИзделияЗаказчика(ИзделиеЗаказчика)

	Возврат ИзделиеЗаказчика.ЦенаВДоговоре;	

КонецФункции // ПолучитьЦенуИзделияЗаказчика()

Процедура ПолучитьНомерПоПорядку()
	
	
	Если НЕ ЗначениеЗаполнено(Объект.Проект) Тогда
		Объект.НомерПоПорядку = 0;	
		Возврат;
	КонецЕсли;
	

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЕСТЬNULL(МАКСИМУМ(ПриложенияКДоговорам.НомерПоПорядку), -1) КАК НомерПоПорядку
		|ИЗ
		|	Справочник.ПриложенияКДоговорам КАК ПриложенияКДоговорам
		|ГДЕ
		|	ПриложенияКДоговорам.Проект = &Проект";
	
	Запрос.УстановитьПараметр("Проект", Объект.Проект);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Объект.НомерПоПорядку = Выборка.НомерПоПорядку + 1;	
	КонецЦикла;
	
КонецПроцедуры // ПолучитьНомерПоПорядку()

Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	

	Если Параметры.Ключ.Пустая() Тогда
		Объект.ДатаСоздания = ТекущаяДата();
		Объект.Автор  		= ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;
	
	ЭтаФорма.Элементы.Отказ.Видимость = НЕ Объект.НомерПоПорядку = 0;
	ВидимостьПоПравам();
	
	ЗаполнитьЦены();
КонецПроцедуры  

Процедура ВидимостьПоПравам()

	Если РольДоступна("ЦенаВДоговоре") Тогда
		ЭтаФорма.ПоказыватьЦену = Истина;
	Иначе
		ЭтаФорма.Элементы.УслугиПриложенияДоговораЦена.Видимость 	= Ложь;
		ЭтаФорма.Элементы.УслугиПриложенияДоговораСумма.Видимость 	= Ложь;
		ЭтаФорма.Элементы.ЭлементыСделкиЦена.Видимость 				= Ложь;
		
		ЭтаФорма.Элементы.УслугиПриложенияДоговора.ТолькоПросмотр 	= Истина;
	КонецЕсли;
	

КонецПроцедуры // ВидимостьПоПравам()     

Процедура ЗаполнитьЦены()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПриложенияКДоговорамИзделияЗаказчика.ИзделиеЗаказчика КАК ИзделиеЗаказчика,
		|	ПриложенияКДоговорамИзделияЗаказчика.ИзделиеЗаказчика.ЦенаВДоговоре КАК ЦенаВДоговоре
		|ИЗ
		|	Справочник.ПриложенияКДоговорам.ИзделияЗаказчика КАК ПриложенияКДоговорамИзделияЗаказчика
		|ГДЕ
		|	ПриложенияКДоговорамИзделияЗаказчика.ИзделиеЗаказчика В(&ИзделиеЗаказчика)
		|	И ПриложенияКДоговорамИзделияЗаказчика.ИзделиеЗаказчика.ЦенаВДоговоре <> 0";
	
	Запрос.УстановитьПараметр("ИзделиеЗаказчика", Объект.ИзделияЗаказчика.Выгрузить().ВыгрузитьКолонку("ИзделиеЗаказчика"));
	
	Выборка = Запрос.Выполнить().Выбрать();
	стОтбор = Новый Структура("ИзделиеЗаказчика", );
	
	Пока Выборка.Следующий() Цикл
		стОтбор.ИзделиеЗаказчика = Выборка.ИзделиеЗаказчика;
		НайденыеСтроки = Объект.ИзделияЗаказчика.НайтиСтроки(стОтбор);
		
		Для каждого х Из НайденыеСтроки Цикл
			х.Цена = Выборка.ЦенаВДоговоре;
		КонецЦикла;
	КонецЦикла;

КонецПроцедуры // ЗаполнитьЦены()

&НаКлиенте
Процедура СделкаПриИзменении(Элемент)
	ПолучитьНомерПоПорядку();
	ЭтаФорма.Элементы.Отказ.Видимость = НЕ Объект.НомерПоПорядку = 0;
КонецПроцедуры

Процедура ИзменитьПроверитьНумерациюИзделийЗаказчика(ТекущийОбъект)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДанныеИзделияЗаказчика.ИзделиеЗаказчика КАК ИзделиеЗаказчика,
		|	ДанныеИзделияЗаказчика.Актуальность КАК Актуальность,
		|	ДанныеИзделияЗаказчика.НомерПоПорядку КАК НомерПоПорядку,
		|	ДанныеИзделияЗаказчика.НаименованиеСАртикулом КАК НаименованиеСАртикулом,
		|	ЛОЖЬ КАК ПроверкаПрошла
		|ИЗ
		|	РегистрСведений.ДанныеИзделияЗаказчика КАК ДанныеИзделияЗаказчика
		|ГДЕ
		|	ДанныеИзделияЗаказчика.ПриложениеКДоговору = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДоговораСделкиИзделияЗаказчика.ИзделиеЗаказчика КАК ИзделиеЗаказчика,
		|	ДоговораСделкиИзделияЗаказчика.НомерСтроки КАК НомерСтроки
		|ИЗ
		|	Справочник.ПриложенияКДоговорам.ИзделияЗаказчика КАК ДоговораСделкиИзделияЗаказчика
		|ГДЕ
		|	ДоговораСделкиИзделияЗаказчика.Ссылка = &Ссылка
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДоговораСделкиИзделияЗаказчика.НомерСтроки";
	
	Запрос.УстановитьПараметр("Проект", ТекущийОбъект.Проект);
	Запрос.УстановитьПараметр("Ссылка", ТекущийОбъект.Ссылка);
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	тзДанныеИзделияЗаказчика = РезультатЗапроса[0].Выгрузить();
	тзДанныеИзделияЗаказчика.Индексы.Добавить("ИзделиеЗаказчика");
	
	Выборка = РезультатЗапроса[1].Выбрать();
	
	Пока Выборка.Следующий() Цикл
		НайденаяСтрока = тзДанныеИзделияЗаказчика.Найти(Выборка.ИзделиеЗаказчика,"ИзделиеЗаказчика");
		Если НайденаяСтрока = Неопределено Тогда
		
			СоздатьЗаписьВРегистре(Выборка.ИзделиеЗаказчика,Выборка.НомерСтроки,ТекущийОбъект.Проект);	
		
		Иначе
			
			Артикул = Справочники.ИзделияЗаказчика.ПолучитьАртикулОбъекта(Выборка.ИзделиеЗаказчика,ТекущийОбъект.Проект,ТекущийОбъект.НомерПоПорядку,Выборка.НомерСтроки);
			НаименованиеСАртикулом =  Артикул + "." + СокрЛП(Выборка.ИзделиеЗаказчика);
			
			Если НЕ (НайденаяСтрока.НомерПоПорядку = Выборка.НомерСтроки И НаименованиеСАртикулом = НайденаяСтрока.НаименованиеСАртикулом) Тогда
				СоздатьЗаписьВРегистре(Выборка.ИзделиеЗаказчика,Выборка.НомерСтроки,ТекущийОбъект.Проект);	
			КонецЕсли;
			
			НайденаяСтрока.ПроверкаПрошла = Истина;
		
		КонецЕсли;
		
	КонецЦикла; 
	
	стОтбор = Новый Структура("ПроверкаПрошла", Ложь);
	
	НайденыеСтроки = тзДанныеИзделияЗаказчика.НайтиСтроки(стОтбор);
	
	Для каждого х Из НайденыеСтроки Цикл
		МенеджерЗаписи = РегистрыСведений.ДанныеИзделияЗаказчика.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.ИзделиеЗаказчика = х.ИзделиеЗаказчика;
		МенеджерЗаписи.Прочитать();
		
		МенеджерЗаписи.НомерПоПорядку		= 0;
		МенеджерЗаписи.Артикул				= Справочники.ИзделияЗаказчика.ПолучитьАртикулОбъекта(х.ИзделиеЗаказчика,ТекущийОбъект.Проект,"",0);
		МенеджерЗаписи.ПриложениеКДоговору	= Справочники.ПриложенияКДоговорам.ПустаяСсылка();
		
		МенеджерЗаписи.Записать();
	КонецЦикла;
	

КонецПроцедуры // ИзменитьПроверитьНумерациюИзделийЗаказчика()

Процедура СоздатьЗаписьВРегистре(ИзделиеЗаказчика, текНомерПоПорядку, Сделка)

	МенеджерЗаписи = РегистрыСведений.ДанныеИзделияЗаказчика.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Актуальность 			= Истина;
	МенеджерЗаписи.ИзделиеЗаказчика 		= ИзделиеЗаказчика;
	МенеджерЗаписи.НомерПоПорядку 			= текНомерПоПорядку;
	МенеджерЗаписи.Проект 					= Сделка;
	МенеджерЗаписи.ПриложениеКДоговору		= Объект.Ссылка;
	
	МенеджерЗаписи.Артикул 					= Справочники.ИзделияЗаказчика.ПолучитьАртикулОбъекта(ИзделиеЗаказчика,Сделка,Объект.НомерПоПорядку,текНомерПоПорядку);
	МенеджерЗаписи.НаименованиеСАртикулом 	= МенеджерЗаписи.Артикул + "." + СокрЛП(ИзделиеЗаказчика);
	
	МенеджерЗаписи.Записать();

КонецПроцедуры // СоздатьЗаписьВРегистре()

Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	ИзменитьПроверитьНумерациюИзделийЗаказчика(ТекущийОбъект);
КонецПроцедуры

&НаКлиенте
Процедура УслугиПриложенияДоговораКоличествоПриИзменении(Элемент)
	ПерерасчетСуммы(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура УслугиПриложенияДоговораЦенаПриИзменении(Элемент)
	ПерерасчетСуммы(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура УслугиПриложенияДоговораСуммаПриИзменении(Элемент)
	ПерерасчетСуммы(Истина);
КонецПроцедуры 

&НаКлиенте
Процедура ПерерасчетСуммы(ПерерасчетСуммы)
 	ТД = Элементы.УслугиПриложенияДоговора.ТекущиеДанные;
	
	Если ТД = Неопределено ИЛИ НЕ ЭтаФорма.ПоказыватьЦену Тогда
		Возврат;	
	КонецЕсли;
	
    Если ПерерасчетСуммы Тогда
	
		Если ТД.Количество = 0 Тогда
			ТД.Цена = ТД.Сумма;	
		Иначе
			ТД.Цена = ТД.Сумма / ТД.Количество;	
		КонецЕсли;	
	
	Иначе
		ТД.Сумма = ТД.Количество * ТД.Цена;	
	КонецЕсли; 
	
	СуммаДоговораСтрокой();
КонецПроцедуры // ПерерасчетСуммы()

&НаКлиенте
Процедура СуммаДоговораСтрокой()
	
	СуммаИзделий 	= Объект.ИзделияЗаказчика.Итог("Цена");
	СуммаУслуг 		= Объект.УслугиПриложенияДоговора.Итог("Сумма");
	
	стрСообщение = ?(СуммаИзделий = 0, "", "Сумма изделий = " + СуммаИзделий)
				 + ?(СуммаУслуг = 0, ".", ". Сумма услуг = " + СуммаУслуг)	
				 + ?(СуммаУслуг = 0 ИЛИ СуммаИзделий = 0, ".", ". ИТОГО = " + (СуммаУслуг + СуммаИзделий));
				 
	ЭтаФорма.ЦенаСтрокой = стрСообщение;

КонецПроцедуры // СуммаДоговораСтрокой()

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если  ЭтаФорма.ПоказыватьЦену Тогда
		СуммаДоговораСтрокой();
	КонецЕсли;
	
	РасчетПсиДаты();
	
	ВидимостьПодписи();

КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПечатьКраткоеНаСервере()
	// Вставить содержимое обработчика.
КонецПроцедуры


&НаКлиенте
Процедура ПечатьКраткое(Команда)
	ПечатьКраткоеНаСервере();
КонецПроцедуры


&НаКлиенте
Процедура СрокПроизводстваВНеделяхПриИзменении(Элемент)
	РасчетПсиДаты();
КонецПроцедуры


&НаКлиенте
Процедура СрокМонтажаВНеделяхПриИзменении(Элемент)
	РасчетПсиДаты();
КонецПроцедуры


&НаКлиенте
Процедура ВнутреннийЗапасВНеделяхПриИзменении(Элемент)
	РасчетПсиДаты();
КонецПроцедуры

&НаКлиенте
Процедура РасчетПсиДаты()
	СекундВНеделе = 24 * 7 * 3600;
	
	ЭтаФорма.ПсиДата = Объект.ДатаДоговора + Объект.СрокМонтажаВНеделях * СекундВНеделе + Объект.СрокПроизводстваВНеделях * СекундВНеделе + Объект.ВнутреннийЗапасВНеделях * СекундВНеделе;		

КонецПроцедуры // РасчетПсиДаты()

&НаКлиенте
Процедура ПодписатьПриИзменении(Элемент)
	
	Если Подписать Тогда
	
		Объект.ПодписьДата 	= ТекущаяДата();
		Объект.ПодписьАвтор = омСотрудники.ПолучитьТекущегоПользователя();
	
		Элементы.ПодписьДата.Видимость 	= Истина;
		Элементы.ПодписьАвтор.Видимость = Истина;

	Иначе
	
		Объект.ПодписьДата 	= Дата(1, 1, 1);
		Объект.ПодписьАвтор = ПредопределенноеЗначение("Справочник.Пользователи.ПустаяСсылка");
	
		Элементы.ПодписьДата.Видимость 	= Ложь;
		Элементы.ПодписьАвтор.Видимость = Ложь;

	КонецЕсли;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ВидимостьПодписи()

	Если Объект.ПодписьДата = Дата(1, 1, 1) Тогда
		
		Элементы.ПодписьДата.Видимость 	= Ложь;
		Элементы.ПодписьАвтор.Видимость = Ложь;
		
	Иначе
	
		Элементы.Подписать.Видимость = Ложь;
		
		ЭтаФорма.ТолькоПросмотр = Истина;
	
	КонецЕсли;

КонецПроцедуры // ВидимостьПодписи()
